sample_app_/app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$m.NPX1s0VYAK1Z7lFpT5y.4n32om/SjsOE3ookhR9zbCCyayvmNdG"], ["updated_at", "2017-10-11 06:30:30.588198"], ["id", 1]]