sample_app/app/views/users/show.html.erb

  <div>
    <%if @user.microposts.any?%>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]